kafka/perf-test-results/storageOS/test2/producer.log
root@kafka-test-client:/# kafka-topics --zookeeper my-kafka-zookeeper:2181 --create --topic test-rep-two --partitions 6 --replication-factor 2
Created topic "test-rep-two".
root@kafka-test-client:/# kafka-run-class org.apache.kafka.tools.ProducerPerformance --print-metrics --topic test-rep-two --num-records 60000000 --throughput -1 --record-size 100 --producer-props bootstrap.servers=my-kafka:9092 buffer.memory=67108864 batch.size=8196
713290 records sent, 142658.0 records/sec (13.60 MB/sec), 450.2 ms avg latency, 724.0 max latency.
976921 records sent, 193987.5 records/sec (18.50 MB/sec), 216.9 ms avg latency, 776.0 max latency.
1151193 records sent, 227778.6 records/sec (21.72 MB/sec), 40.6 ms avg latency, 230.0 max latency.
1136224 records sent, 227244.8 records/sec (21.67 MB/sec), 34.4 ms avg latency, 249.0 max latency.
1164034 records sent, 231464.3 records/sec (22.07 MB/sec), 27.3 ms avg latency, 216.0 max latency.
1076034 records sent, 215163.8 records/sec (20.52 MB/sec), 39.2 ms avg latency, 236.0 max latency.
1157837 records sent, 230507.1 records/sec (21.98 MB/sec), 38.6 ms avg latency, 189.0 max latency.
1082170 records sent, 216434.0 records/sec (20.64 MB/sec), 46.7 ms avg latency, 233.0 max latency.
1158905 records sent, 231410.7 records/sec (22.07 MB/sec), 43.8 ms avg latency, 270.0 max latency.
1111562 records sent, 220986.5 records/sec (21.07 MB/sec), 35.3 ms avg latency, 236.0 max latency.
1126112 records sent, 224638.3 records/sec (21.42 MB/sec), 36.4 ms avg latency, 258.0 max latency.
1137664 records sent, 226310.7 records/sec (21.58 MB/sec), 36.6 ms avg latency, 229.0 max latency.
1118840 records sent, 223365.9 records/sec (21.30 MB/sec), 36.1 ms avg latency, 204.0 max latency.
1073068 records sent, 214613.6 records/sec (20.47 MB/sec), 42.0 ms avg latency, 299.0 max latency.
1119334 records sent, 222399.0 records/sec (21.21 MB/sec), 34.9 ms avg latency, 188.0 max latency.
1078200 records sent, 215209.6 records/sec (20.52 MB/sec), 33.3 ms avg latency, 246.0 max latency.
1110856 records sent, 220145.9 records/sec (20.99 MB/sec), 24.9 ms avg latency, 209.0 max latency.
1130110 records sent, 224718.6 records/sec (21.43 MB/sec), 29.3 ms avg latency, 232.0 max latency.
1134960 records sent, 226493.7 records/sec (21.60 MB/sec), 35.9 ms avg latency, 258.0 max latency.
1111450 records sent, 219958.4 records/sec (20.98 MB/sec), 45.3 ms avg latency, 383.0 max latency.
1161158 records sent, 231398.6 records/sec (22.07 MB/sec), 33.7 ms avg latency, 209.0 max latency.
1159086 records sent, 230160.0 records/sec (21.95 MB/sec), 27.7 ms avg latency, 196.0 max latency.
1095470 records sent, 217960.6 records/sec (20.79 MB/sec), 33.5 ms avg latency, 196.0 max latency.
1145928 records sent, 226647.2 records/sec (21.61 MB/sec), 31.9 ms avg latency, 205.0 max latency.
1151186 records sent, 227372.3 records/sec (21.68 MB/sec), 41.8 ms avg latency, 249.0 max latency.
1080534 records sent, 213755.5 records/sec (20.39 MB/sec), 42.0 ms avg latency, 271.0 max latency.
1075634 records sent, 214056.5 records/sec (20.41 MB/sec), 34.3 ms avg latency, 248.0 max latency.
1159086 records sent, 230801.7 records/sec (22.01 MB/sec), 37.2 ms avg latency, 287.0 max latency.
1114770 records sent, 220834.0 records/sec (21.06 MB/sec), 35.3 ms avg latency, 239.0 max latency.
1127488 records sent, 224823.1 records/sec (21.44 MB/sec), 36.3 ms avg latency, 225.0 max latency.
1110060 records sent, 220995.4 records/sec (21.08 MB/sec), 35.0 ms avg latency, 193.0 max latency.
1144392 records sent, 224126.9 records/sec (21.37 MB/sec), 31.8 ms avg latency, 191.0 max latency.
1739106 records sent, 345746.7 records/sec (32.97 MB/sec), 69.5 ms avg latency, 627.0 max latency.
1095077 records sent, 218665.5 records/sec (20.85 MB/sec), 46.8 ms avg latency, 257.0 max latency.
1131939 records sent, 224457.5 records/sec (21.41 MB/sec), 30.6 ms avg latency, 240.0 max latency.
1052313 records sent, 209707.7 records/sec (20.00 MB/sec), 48.5 ms avg latency, 335.0 max latency.
1155353 records sent, 230978.2 records/sec (22.03 MB/sec), 31.1 ms avg latency, 189.0 max latency.
1125218 records sent, 225043.6 records/sec (21.46 MB/sec), 37.5 ms avg latency, 209.0 max latency.
1189090 records sent, 236493.6 records/sec (22.55 MB/sec), 39.3 ms avg latency, 197.0 max latency.
1059036 records sent, 211807.2 records/sec (20.20 MB/sec), 46.0 ms avg latency, 265.0 max latency.
1167654 records sent, 230261.1 records/sec (21.96 MB/sec), 48.4 ms avg latency, 348.0 max latency.
1027922 records sent, 204074.3 records/sec (19.46 MB/sec), 38.3 ms avg latency, 186.0 max latency.
1077092 records sent, 215375.3 records/sec (20.54 MB/sec), 29.5 ms avg latency, 205.0 max latency.
1106738 records sent, 221347.6 records/sec (21.11 MB/sec), 45.6 ms avg latency, 462.0 max latency.
1127062 records sent, 225412.4 records/sec (21.50 MB/sec), 28.5 ms avg latency, 180.0 max latency.
1092678 records sent, 217145.9 records/sec (20.71 MB/sec), 37.7 ms avg latency, 190.0 max latency.
1110862 records sent, 220979.1 records/sec (21.07 MB/sec), 37.4 ms avg latency, 218.0 max latency.
1150978 records sent, 229736.1 records/sec (21.91 MB/sec), 50.7 ms avg latency, 338.0 max latency.
1032476 records sent, 206453.9 records/sec (19.69 MB/sec), 32.0 ms avg latency, 219.0 max latency.
1068298 records sent, 212385.3 records/sec (20.25 MB/sec), 57.3 ms avg latency, 437.0 max latency.
1105920 records sent, 219428.6 records/sec (20.93 MB/sec), 26.2 ms avg latency, 226.0 max latency.
1128154 records sent, 225630.8 records/sec (21.52 MB/sec), 44.5 ms avg latency, 232.0 max latency.
1095118 records sent, 219023.6 records/sec (20.89 MB/sec), 35.3 ms avg latency, 229.0 max latency.
60000000 records sent, 222707.229077 records/sec (21.24 MB/sec), 46.02 ms avg latency, 776.00 ms max latency, 6 ms 50th, 140 ms 95th, 452 ms 99th, 638 ms 99.9th.

Metric Name                                                                            Value
app-info:commit-id:{client-id=producer-1}                                            : 815feb8a888d39d9
app-info:version:{client-id=producer-1}                                              : 2.0.1-cp1
kafka-metrics-count:count:{client-id=producer-1}                                     : 118.000
producer-metrics:batch-size-avg:{client-id=producer-1}                               : 7023.016
producer-metrics:batch-size-max:{client-id=producer-1}                               : 8196.000
producer-metrics:batch-split-rate:{client-id=producer-1}                             : 0.000
producer-metrics:batch-split-total:{client-id=producer-1}                            : 0.000
producer-metrics:buffer-available-bytes:{client-id=producer-1}                       : 67108864.000
producer-metrics:buffer-exhausted-rate:{client-id=producer-1}                        : 0.000
producer-metrics:buffer-exhausted-total:{client-id=producer-1}                       : 0.000
producer-metrics:buffer-total-bytes:{client-id=producer-1}                           : 67108864.000
producer-metrics:bufferpool-wait-ratio:{client-id=producer-1}                        : 0.000
producer-metrics:bufferpool-wait-time-total:{client-id=producer-1}                   : 0.000
producer-metrics:compression-rate-avg:{client-id=producer-1}                         : 1.000
producer-metrics:connection-close-rate:{client-id=producer-1}                        : 0.000
producer-metrics:connection-close-total:{client-id=producer-1}                       : 0.000
producer-metrics:connection-count:{client-id=producer-1}                             : 4.000
producer-metrics:connection-creation-rate:{client-id=producer-1}                     : 0.000
producer-metrics:connection-creation-total:{client-id=producer-1}                    : 4.000
producer-metrics:failed-authentication-rate:{client-id=producer-1}                   : 0.000
producer-metrics:failed-authentication-total:{client-id=producer-1}                  : 0.000
producer-metrics:incoming-byte-rate:{client-id=producer-1}                           : 162250.888
producer-metrics:incoming-byte-total:{client-id=producer-1}                          : 44415070.000
producer-metrics:io-ratio:{client-id=producer-1}                                     : 0.142
producer-metrics:io-time-ns-avg:{client-id=producer-1}                               : 144496.329
producer-metrics:io-wait-ratio:{client-id=producer-1}                                : 0.026
producer-metrics:io-wait-time-ns-avg:{client-id=producer-1}                          : 26844.157
producer-metrics:io-waittime-total:{client-id=producer-1}                            : 6710079052.000
producer-metrics:iotime-total:{client-id=producer-1}                                 : 39631982759.000
producer-metrics:metadata-age:{client-id=producer-1}                                 : 269.203
producer-metrics:network-io-rate:{client-id=producer-1}                              : 3452.069
producer-metrics:network-io-total:{client-id=producer-1}                             : 945044.000
producer-metrics:outgoing-byte-rate:{client-id=producer-1}                           : 24368117.053
producer-metrics:outgoing-byte-total:{client-id=producer-1}                          : 6637473115.000
producer-metrics:produce-throttle-time-avg:{client-id=producer-1}                    : 0.000
producer-metrics:produce-throttle-time-max:{client-id=producer-1}                    : 0.000
producer-metrics:record-error-rate:{client-id=producer-1}                            : 0.000
producer-metrics:record-error-total:{client-id=producer-1}                           : 0.000
producer-metrics:record-queue-time-avg:{client-id=producer-1}                        : 26.283
producer-metrics:record-queue-time-max:{client-id=producer-1}                        : 435.000
producer-metrics:record-retry-rate:{client-id=producer-1}                            : 0.000
producer-metrics:record-retry-total:{client-id=producer-1}                           : 0.000
producer-metrics:record-send-rate:{client-id=producer-1}                             : 220318.405
producer-metrics:record-send-total:{client-id=producer-1}                            : 60000000.000
producer-metrics:record-size-avg:{client-id=producer-1}                              : 186.000
producer-metrics:record-size-max:{client-id=producer-1}                              : 186.000
producer-metrics:records-per-request-avg:{client-id=producer-1}                      : 127.602
producer-metrics:request-latency-avg:{client-id=producer-1}                          : 8.153
producer-metrics:request-latency-max:{client-id=producer-1}                          : 227.000
producer-metrics:request-rate:{client-id=producer-1}                                 : 1725.933
producer-metrics:request-size-avg:{client-id=producer-1}                             : 14118.332
producer-metrics:request-size-max:{client-id=producer-1}                             : 16462.000
producer-metrics:request-total:{client-id=producer-1}                                : 472522.000
producer-metrics:requests-in-flight:{client-id=producer-1}                           : 0.000
producer-metrics:response-rate:{client-id=producer-1}                                : 1726.136
producer-metrics:response-total:{client-id=producer-1}                               : 472522.000
producer-metrics:select-rate:{client-id=producer-1}                                  : 980.606
producer-metrics:select-total:{client-id=producer-1}                                 : 280392.000
producer-metrics:successful-authentication-rate:{client-id=producer-1}               : 0.000
producer-metrics:successful-authentication-total:{client-id=producer-1}              : 0.000
producer-metrics:waiting-threads:{client-id=producer-1}                              : 0.000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node--1}     : 0.000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-0}      : 53343.998
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-1}      : 54705.503
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-2}      : 54263.588
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node--1}    : 644.000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-0}     : 14590878.000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-1}     : 15047924.000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-2}     : 14775624.000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node--1}     : 0.000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-0}      : 8122314.333
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-1}      : 8125457.173
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-2}      : 8123800.855
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node--1}    : 67.000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-0}     : 2212114500.000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-1}     : 2212920541.000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-2}     : 2212438007.000
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node--1}    : 0.000
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-0}     : 8.306
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-1}     : 8.102
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-2}     : 8.054
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node--1}    : -Infinity
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-0}     : 195.000
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-1}     : 199.000
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-2}     : 227.000
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node--1}           : 0.000
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-0}            : 567.432
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-1}            : 581.971
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-2}            : 577.221
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node--1}       : 0.000
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-0}        : 14313.913
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-1}        : 13961.736
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-2}        : 14073.758
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node--1}       : -Infinity
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-0}        : 16462.000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-1}        : 16462.000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-2}        : 16462.000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node--1}          : 2.000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-0}           : 155224.000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-1}           : 160098.000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-2}           : 157198.000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node--1}          : 0.000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-0}           : 567.510
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-1}           : 582.048
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-2}           : 577.298
producer-node-metrics:response-total:{client-id=producer-1, node-id=node--1}         : 2.000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-0}          : 155224.000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-1}          : 160098.000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-2}          : 157198.000
producer-topic-metrics:byte-rate:{client-id=producer-1, topic=test-rep-two}          : 24249880.740
producer-topic-metrics:byte-total:{client-id=producer-1, topic=test-rep-two}         : 6604397586.000
producer-topic-metrics:compression-rate:{client-id=producer-1, topic=test-rep-two}   : 1.000
producer-topic-metrics:record-error-rate:{client-id=producer-1, topic=test-rep-two}  : 0.000
producer-topic-metrics:record-error-total:{client-id=producer-1, topic=test-rep-two} : 0.000
producer-topic-metrics:record-retry-rate:{client-id=producer-1, topic=test-rep-two}  : 0.000
producer-topic-metrics:record-retry-total:{client-id=producer-1, topic=test-rep-two} : 0.000
producer-topic-metrics:record-send-rate:{client-id=producer-1, topic=test-rep-two}   : 220318.405
producer-topic-metrics:record-send-total:{client-id=producer-1, topic=test-rep-two}  : 60000000.000
root@kafka-test-client:/#